Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.LoadsBCsOutsideOfHostDuringSplit
Loads or Boundary Conditions outside of splited element boundaries will not be modified during split.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.LoadsBCsInnerContoursDeletedDuringSplit
During the split process, the interior contours of unconstrained area loads and boundary conditions were removed.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.EnterPositiveValueLessThan
Please enter a positive value less than [Value].

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.BCRehostedFromOpeningToPanel
Boundary Conditions were re-hosted from the Analytical Opening to the Analytical Panel during upgrade.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelSplitNothing
The Analytical Panel cannot be split. The cutting plane does not intersect the panel in a way that creates a valid split.